module.exports = [
  {
    "q": "Какое из этих утверждений не является верным для Enum в Swift?",
    "a": [
      "Для Enum можно объявить инициализаторы",
      "Enum может иметь аттрибут @objc",
      "Enum - value type",
      "Все утверждения верны"
    ],
    "v": "4",
    "c": "iOS-10"
  },
  {
    "q": "Какое из этих утверждений является верным для Struct в Swift?",
    "a": [
      "Struct может иметь аттрибут @objc",
      "Для Struct можно определить метод deinit",
      "От Struct можно наследоваться",
      "Все утверждения неверны"
    ],
    "v": "4",
    "c": "iOS-10"
  },
  {
    "q": "Какое из этих утверждений является неверным для замыканий (closures) в Swift?",
    "a": [
      "Память для closure выделяется на стеке",
      "По-умолчанию closure захватывает переменную как strong",
      "Вложенные и глобальные функции являются замыканиями",
      "Все утверждения неверны"
    ],
    "v": "1",
    "c": "iOS-10"
  }
];
