module.exports = [
  {
    "q": "Что будет выведено в консоль в результате выполнения фрагмента кода?\r\n\r\nlet a = 5\r\nlet b = 3\r\nlet c = a & b\r\nprint(c)",
    "a": [
      "0",
      "1",
      "2",
      "3"
    ],
    "v": "2",
    "c": "iOS-6"
  },
  {
    "q": "Что будет выведено в консоль в результате выполнения фрагмента кода?\r\n\r\nlet a = 7\r\nlet b = 3\r\nlet c = a | b\r\nprint(c)",
    "a": [
      "1",
      "3",
      "5",
      "7"
    ],
    "v": "4",
    "c": "iOS-6"
  },
  {
    "q": "Что будет выведено в консоль в результате выполнения фрагмента кода?\r\n\r\nlet a = 3\r\nlet b = 1\r\nlet c = a << b\r\nprint(c)",
    "a": [
      "1",
      "2",
      "4",
      "6"
    ],
    "v": "4",
    "c": "iOS-6"
  },
  {
    "q": "Что будет выведено в консоль в результате выполнения фрагмента кода?\r\n\r\nlet a = 3\r\nlet b = 1\r\nlet c = a >> b\r\nprint(c)",
    "a": [
      "1",
      "2",
      "4",
      "6"
    ],
    "v": "1",
    "c": "iOS-6"
  }
];
