module.exports = [
  {
    "q": "Какое из этих утверждений не является верным для Enum в Swift?",
    "a": [
      "Для Enum можно объявить инициализаторы",
      "Enum может иметь атрибут @objc",
      "Enum - value type",
      "Все утверждения верны"
    ],
    "v": "4",
    "c": "iOS-10"
  },
  {
    "q": "Какое из этих утверждений является верным для Struct в Swift?",
    "a": [
      "Struct может иметь атрибут @objc",
      "Для Struct можно определить метод deinit",
      "От Struct можно наследоваться",
      "Все утверждения неверны"
    ],
    "v": "4",
    "c": "iOS-10"
  },
  {
    "q": "Что будет выведено в консоль в результате выполнения фрагмента кода?\r\n\r\nvar num = 0\r\nlet closure = {\r\n\t[num] in num += 1\r\n}\r\nnum += 1\r\nclosure()\r\nprint(num)",
    "a": [
      "0",
      "1",
      "2",
      "Возникнет ошибка компиляции"
    ],
    "v": "4",
    "c": "iOS-10"
  }
]

