module.exports = [
  {
    "q": "Java. Где будут видны поля и методы класса Clazz обозначенные модификатором protected?",
    "a": [
      "Только в классах, находящихся в том же пакете, что и Clazz",
      "Только в наследниках класса Clazz",
      "В классах, находящихся в том же пакете и в наследниках класса Clazz",
      "Только в классах, находящихся в одном модуле с классом Clazz"
    ],
    "v": "3",
    "c": "android-6"
  },
  {
    "q": "Java. Какие 2 метода из следующих определены в классе Thread?\r\n1) wait()\r\n2) notify()\r\n3) run()\r\n4) terminate()\r\n5) start()",
    "a": [
      "3 и 5",
      "1 и 2",
      "2 и 3",
      "4 и 5"
    ],
    "v": "1",
    "c": "android-6"
  },
  {
    "q": "Java. Что произойдет, если вызвать метод run() у класса MyThread, который наследован от Thread?",
    "a": [
      "Код внутри run() выполнится в потоке MyThread",
      "Код внутри run() выполнится в потоке, из которого был вызван этот метод",
      "Произойдет ошибка компиляции",
      "Ничего не произойдет"
    ],
    "v": "2",
    "c": "android-6"
  }
];
